<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [25]:
import sqlite3
import os
import pandas as pd

In [99]:
path = os.path.dirname(os.path.realpath('__file__'))
conn = sqlite3.connect(path+'/sqlrecipe1.db')

In [101]:
cur = conn.cursor()
cur.execute('''CREATE TABLE mst_users(
    user_id         varchar(255)
  , register_date   varchar(255)
  , register_device integer
);''')

In [102]:
cur.execute('''INSERT INTO mst_users
VALUES
    ('U001', '2016-08-26', 1)
  , ('U002', '2016-08-26', 2)
  , ('U003', '2016-08-27', 3)
;
''')

In [6]:
cur = conn.cursor()

In [106]:
def query_print(q):
    df = pd.read_sql_query(q, conn)
    return df

In [107]:
query_print('select * from mst_users')

  user_id register_date  register_device
0    U001    2016-08-26                1
1    U002    2016-08-26                2
2    U003    2016-08-27                3

In [108]:
q = '''select user_id
    , case
        when register_device = 1 then '데스크톱'
        when register_device = 2 then '스마트폰'
        when register_device = 3 then '애플리케이션'
        else ''
    end as device_name
    from mst_users
        '''

query_print(q)

  user_id device_name
0    U001        데스크톱
1    U002        스마트폰
2    U003      애플리케이션

In [109]:
q = '''CREATE TABLE purchase_log_with_coupon (
    purchase_id varchar(255)
  , amount      integer
  , coupon      integer
);'''

In [110]:
cur.execute(q)

In [111]:
q = '''INSERT INTO purchase_log_with_coupon
VALUES
    ('10001', 3280, NULL)
  , ('10002', 4650,  500)
  , ('10003', 3870, NULL)
;'''

In [112]:
cur.execute(q)

In [113]:
q = '''select * from purchase_log_with_coupon'''

In [114]:
query_print(q)

  purchase_id  amount  coupon
0       10001    3280     NaN
1       10002    4650   500.0
2       10003    3870     NaN

In [119]:
q = '''select current_date as dt,
            current_timestamp as stamp'''

query_print(q)

           dt                stamp
0  2021-03-03  2021-03-03 09:57:20

In [143]:
q = '''select strftime('2020-01-01 12:00:00' as stamp) as time
        '''

query_print(q)

DatabaseError: Execution failed on sql 'select strftime('2020-01-01 12:00:00' as stamp) as time
        ': near "as": syntax error